"""
表計算ソフトにはオートフィルという機能があります。
この機能は選択している表の部分の縦と横の数列の差から等差数列を作り、その数列で残りを入力してくれます。

すなわち、 2 行 2 列目以降の i 行 j 列目の要素を a_{i, j} で表した場合

・a_{i, j} = a_{i, j - 1} + (a_{i, 2} - a_{i, 1}) ※ 任意の行が等差数列になっている事を示します
・a_{i, j} = a_{i - 1, j} + (a_{2, j} - a_{1, j}) ※ 任意の列が等差数列になっている事を示します

を同時に満たすように表に入力します。
・1 行目に、表の行数を表す整数 H と 列数を表す整数 W がこの順で半角スペース区切りで与えられます。
・2 行目に、表の 1 行目にある整数の 2 要素 a_{1, 1}, a_{1, 2} がこの順で半角スペース区切りで与えられます。
・3 行目に、表の 2 行目にある整数の 2 要素 a_{2, 1}, a_{2, 2} がこの順で半角スペース区切りで与えられます。
・入力は合計で 3 行となり、入力値最終行の末尾に改行が 1 つ入ります。
入力例1
5 5
1 2
3 4

出力例1
1 2 3 4 5
3 4 5 6 7
5 6 7 8 9
7 8 9 10 11
9 10 11 12 13

入力例2
5 7
1 5
-2 1

出力例2
1 5 9 13 17 21 25
-2 1 4 7 10 13 16
-5 -3 -1 1 3 5 7
-8 -7 -6 -5 -4 -3 -2
-11 -11 -11 -11 -11 -11 -11
"""


input_lines = input().split(' ')

row = int(input_lines[0])  #列数
column = int(input_lines[1])  #行数

input1 = input().split(' ')
input2 = input().split(' ')

dif1 = int(input1[1])-int(input1[0])  #1行めの等差

ans1 = [int(input1[0])+dif1*(i-1) for i in range(1,column+1)] #1行目のリスト
print(' '.join(map(str,ans1)))

dif2 = int(input2[1])-int(input2[0])  #2行めの等差
a2 = [int(input2[0])+dif2*(i-1) for i in range(1,column+1)]  #2行目のリスト

print(ans1)
combined1 = [y - x for (x, y) in zip(ans1, a2)] #1行目と2行目の差分をリスト化

#入力例1 combined1 = [2, 2, 2, 2, 2]
#入力例2 combined1 = [-3, -4, -5, -6, -7, -8, -9]


ans = []
for j in range(row-1):
    ak = [x+y for (x, y) in zip(ans1, combined1)]
    ans.append(ak)
    ans1 = ak  #ans1を、次の行リストとなるリストakに上書き

"""
zip(ans1, combined1)は1行目のリストから差分を足していったものと差分を組み合わせたもの

入力例1
list(zip(ans1, combined1)) = [(3, 2), (4, 2), (5, 2), (6, 2), (7, 2)]
                             [(5, 2), (6, 2), (7, 2), (8, 2), (9, 2)]
                             [(7, 2), (8, 2), (9, 2), (10, 2), (11, 2)]
                             [(9, 2), (10, 2), (11, 2), (12, 2), (13, 2)]
                             
入力例2
list(zip(ans1, combined1)) = [(-2, -3), (1, -4), (4, -5), (7, -6), (10, -7), (13, -8), (16, -9)]
                             [(-5, -3), (-3, -4), (-1, -5), (1, -6), (3, -7), (5, -8), (7, -9)]
                             [(-8, -3), (-7, -4), (-6, -5), (-5, -6), (-4, -7), (-3, -8), (-2, -9)]
                             [(-11, -3), (-11, -4), (-11, -5), (-11, -6), (-11, -7), (-11, -8), (-11, -9)]

入力例1
ans = [[3, 4, 5, 6, 7], [5, 6, 7, 8, 9], [7, 8, 9, 10, 11], [9, 10, 11, 12, 13]]
入力例2
ans = [[-2, 1, 4, 7, 10, 13, 16], [-5, -3, -1, 1, 3, 5, 7], [-8, -7, -6, -5, -4, -3, -2], [-11, -11, -11, -11, -11, -11, -11]]
"""
for l in ans:
    print(' '.join(map(str, l)))